# 1. Перевірка знаку числа
num = float(input("Введіть число (визначення знаку): "))
if num > 0:
    print("плюс")
elif num == 0:
    print("нуль")
else:
    print("мінус")

print("-"*40)

# 2. Вікова категорія
age = int(input("Введіть вік: "))
if age < 18:
    print("неповнолітній")
elif 18 <= age <= 59:
    print("дорослий")
else:
    print("пенсіонер")

print("-"*40)

# 3. Перевірка парності числа
num2 = int(input("Введіть число (перевірка парності): "))
if num2 % 2 == 0:
    print("парне")
else:
    print("непарне")
